; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	spectrograph2 - mode
	image0 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star8 - direction
	GroundStation7 - direction
	Star6 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star9)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
)
(:goal (and
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 image0)
	(have_image Phenomenon13 thermograph3)
	(have_image Phenomenon14 thermograph3)
	(have_image Star15 thermograph3)
	(have_image Phenomenon16 thermograph1)
	(have_image Star17 spectrograph2)
	(have_image Planet18 image0)
))

)

; plan
1. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 star9)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 star17 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star17)
   goals met: 0 of 9
5. (take_image satellite0 star17 instrument2 spectrograph2)
   added: (have_image star17 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite0 star15 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star15)
   goals met: 1 of 9
7. (take_image satellite0 star15 instrument2 thermograph3)
   added: (have_image star15 thermograph3)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon14 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon14 instrument2 thermograph3)
   added: (have_image phenomenon14 thermograph3)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon13 instrument2 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 4 of 9
12. (turn_to satellite0 star9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star9)
   goals met: 4 of 9
13. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 4 of 9
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
15. (calibrate satellite0 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 4 of 9
16. (turn_to satellite0 phenomenon10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 9
17. (take_image satellite0 phenomenon10 instrument1 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 5 of 9
18. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 9
19. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 6 of 9
20. (turn_to satellite0 phenomenon16 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 9
21. (take_image satellite0 phenomenon16 instrument1 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 7 of 9
22. (turn_to satellite0 planet18 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet18)
   goals met: 7 of 9
23. (take_image satellite0 planet18 instrument1 image0)
   added: (have_image planet18 image0)
   goals met: 8 of 9
24. (turn_to satellite0 star12 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star12)
   goals met: 8 of 9
25. (take_image satellite0 star12 instrument1 image0)
   added: (have_image star12 image0)
   goals met: 9 of 9
